uhnp/src/AccumulationRegisters/ДвижениеИнвестиций/ДвижениеИнвестиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеИнвестиций</name>
  <resources>
    <name>Инвестиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрямаяДоляВладения</name>
    <type>
      <types>DefinedType.ДоляВладения</types>
    </type>
  </resources>
  <resources>
    <name>БалансоваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПривилегированных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВДоверительномУправлении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоГолосующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инвестор</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектИнвестирования</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/AccumulationRegisters/ДвижениеИнвестиций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Инвестор)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Процедура ПроверитьПроведение(Реквизиты, Отказ = Ложь) Экспорт
	
	Если Не Реквизиты.Свойство("ОбъектИнвестирования") Тогда
		Возврат;//документы учета МСФО без инвестиций	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ДвижениеИнвестицийОстатки.ПрямаяДоляВладенияОстаток) КАК ПрямаяДоля,
	|	СУММА(ДвижениеИнвестицийОстатки.БалансоваяСтоимостьОстаток) КАК БалансоваяСтоимость,
	|	СУММА(ДвижениеИнвестицийОстатки.КоличествоОстаток) КАК Количество,
	|	СУММА(ДвижениеИнвестицийОстатки.КоличествоПривилегированныхОстаток) КАК КоличествоПривилегированных,
	|	СУММА(ДвижениеИнвестицийОстатки.КоличествоГолосующихОстаток) КАК КоличествоГолосующих,
	|	СУММА(ДвижениеИнвестицийОстатки.КоличествоВДоверительномУправленииОстаток) КАК КоличествоВДоверительномУправлении
	|ИЗ
	|	РегистрНакопления.ДвижениеИнвестиций.Остатки(
	|			&ДатаОстатков,
	|			ОбъектИнвестирования В (&ОбъектИнвестирования)
	|				И (ОбъектИнвестирования.ИспользоватьВРегламентированномУчете
	|					ИЛИ ОбъектИнвестирования.ИностранныйНалоговыйРезидент)
	|				И ВЫБОР
	|					КОГДА &Выбытие = ИСТИНА
	|						ТОГДА Инвестор = &Инвестор
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ДвижениеИнвестицийОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвижениеИнвестицийОстатки.ОбъектИнвестирования,
	|	ДвижениеИнвестицийОстатки.Сценарий
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДвижениеИнвестицийОстатки.ПрямаяДоляВладенияОстаток) > 100
	|		ИЛИ СУММА(ДвижениеИнвестицийОстатки.ПрямаяДоляВладенияОстаток) < 0
	|		ИЛИ СУММА(ДвижениеИнвестицийОстатки.БалансоваяСтоимостьОстаток) < 0
	|		ИЛИ СУММА(ДвижениеИнвестицийОстатки.КоличествоОстаток) < 0
	|		ИЛИ СУММА(ДвижениеИнвестицийОстатки.КоличествоГолосующихОстаток) < 0
	|		ИЛИ СУММА(ДвижениеИнвестицийОстатки.КоличествоПривилегированныхОстаток) < 0
	|		ИЛИ СУММА(ДвижениеИнвестицийОстатки.КоличествоВДоверительномУправленииОстаток) < 0)";

	ИмяВыбытие = ?(ОбщегоНазначенияПовтИспУХ.ЕстьРСБУ(), "ДокументСсылка.ВыбытиеИнвестиций", "ДокументСсылка.РеализацияМСФО");
	ЭтоВыбытие = ТипЗнч(Реквизиты.Ссылка) = Тип(ИмяВыбытие) 
		Или ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.РеализацияМСФО");
	
	Запрос.УстановитьПараметр("ДатаОстатков", 			Новый Граница(Новый МоментВремени(Реквизиты.Период, Реквизиты.Ссылка), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Выбытие", 				ЭтоВыбытие);//для для поступлений проверка только > 100
	Запрос.УстановитьПараметр("Инвестор", 				Реквизиты.Организация);
	Запрос.УстановитьПараметр("ОбъектИнвестирования",	Реквизиты.ОбъектИнвестирования);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось провести документ <%1>:'"), Реквизиты.Ссылка);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПрямаяДоля < 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = ' - не достаточная доля владения, не хватает: '") + (-Выборка.ПрямаяДоля);
		ИначеЕсли Выборка.ПрямаяДоля > 100 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = ' - превышение (больше 100%) суммы прямых долей владения в объект инвестирования, превышение на: '") + (Выборка.ПрямаяДоля - 100);
		КонецЕсли;
		
		Если Выборка.Количество < 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = ' - не достаточное количество акций, не хватает: '") + (-Выборка.Количество);
		КонецЕсли;
			
		Если Выборка.БалансоваяСтоимость < 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = ' - не достаточная балансовая стоимость, не хватает: '") + (-Выборка.БалансоваяСтоимость);
		КонецЕсли;
			
		Если Выборка.КоличествоПривилегированных < 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = ' - не достаточное количество привилегированных акций, не хватает: '") + (-Выборка.КоличествоПривилегированных);
		КонецЕсли;
		
		Если Выборка.КоличествоГолосующих < 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = ' - не достаточное количество голосующих акций, не хватает: '") + (-Выборка.КоличествоГолосующих);
		КонецЕсли;
					
		Если Выборка.КоличествоПривилегированных < 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = ' - не достаточное количество привилегированных акций, не хватает: '") + (-Выборка.КоличествоПривилегированных);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения, Отказ);
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
